#include <stdio.h>
#include <string.h>

/*

Burocracia Infernal
A arquidemónio Azirófalo decidiu inovar nas torturas aplicadas às almas penadas. Como esteve recentemente numa repartição de finanças, decidiu que seria mais divertido implementar um sistema semelhante.

Assim, criu uma repartição infernal onde as almas tem que andar de guiché em guiché. O sistema é relativamente simples: - Cada demónio está num guiché - Cada demónio pode trabalhar ou enviar todos os clientes para outro guiché

Isto tem sobretudo piada quando as vitimas ficam presas num ciclo infinito!

Ajuda o Azirófalo a perceber se uma dada configuração dá um ciclo ou não.

Input
O teu programa deve ler:

Uma linha contendo um inteiro N que corresponde ao nº de de casos
Para cada um dos N casos:
Uma linha contendo um inteiro positivo K que corresponde ao nº de guichés (os guichés estão numerados de 1 até K)
Uma linha contendo um inteiro positivo I correspondendo ao guiché inicial
Uma linha com K inteiros positivos que correspondem ao identificador do próximo guiché ou 0 se o demónio estiver a despachar clientes
Assim, o input

1
5
5
3 4 2 1 1
Indica que:

Há um caso
Esse caso contém 5 guichés
Começa-se no guiché nº 5
Eis as transições:
Este guiché não está a atender clientes, todos os clientes devem dirigir-se ao guiché 3
Este guiché não está a atender clientes, todos os clientes devem dirigir-se ao guiché 4
Este guiché não está a atender clientes, todos os clientes devem dirigir-se ao guiché 2
Este guiché não está a atender clientes, todos os clientes devem dirigir-se ao guiché 1
Este guiché não está a atender clientes, todos os clientes devem dirigir-se ao guiché 1
Assim, como se começa no guiché 5, esta é a sequência de visitas:

5 1 3 2 4 1
Mas já tínhamos ido ao guiché 1, e por isso entrámos num ciclo infernal!

Restrições
1 < K <= 100
*/

int Verifica(int *aux, int  g ,int N)
{
    for (int k=0 ;k<N ; k++) {
        if (aux[k]==g) {
            return 1;
        }
    }

    return 0;
}

int main()
{
    int Ncasos,Nguiches,guicheInicial;

    if (scanf("%d ",&Ncasos)) {

        for (int j=0; j<Ncasos ; j++) {
            

            if (scanf("%d",&Nguiches)) {

                int lista_guiches[Nguiches];
                int auxJaVisto[Nguiches];

                if (scanf("%d",&guicheInicial) ){
                
                    for (int i = 0 ; i<Nguiches ; i++) {

                        if (scanf("%d",&lista_guiches[i])) {}

                    }


                    printf("%d",guicheInicial);

                    auxJaVisto[0]=guicheInicial;
                    
                    
                    
                    for (int pos =1; pos<Nguiches+1; pos++) {
                    
                    
                        if (Verifica(auxJaVisto,lista_guiches[guicheInicial-1],pos )==1) {
                            
                            
                            printf(" CICLO INFERNAL\n");
                            break;

                        }else if (lista_guiches[guicheInicial-1]==0) {
                            
                            printf("\n");
                            break;


                        }else if (Verifica(auxJaVisto, lista_guiches[guicheInicial-1], pos)==0) {
                            
                            printf(" %d",lista_guiches[guicheInicial-1]);

                            auxJaVisto[pos] =guicheInicial;
                            
                            guicheInicial=lista_guiches[guicheInicial-1];

                        }

                    }


                }
            
            }
        }
    }
    return 0;

}



/*
Sample Tests
Input 1
4
5
5
3 4 2 1 1
6
2
3 1 4 5 6 0
8
2
6 7 5 0 4 1 3 1
8
8
6 7 5 0 4 1 3 1
Output 1
5 1 3 2 4 CICLO INFERNAL
2 1 3 4 5 6
2 7 3 5 4
8 1 6 CICLO INFERNAL
Input 2
4
94
46
36 76 22 38 32 7 91 5 35 25 92 27 6 4 37 29 68 33 89 67 59 90 2 0 14 8 61 50 83 44 73 85 82 58 57 10 12 43 79 84 52 71 86 16 34 26 45 63 72 17 0 64 31 39 47 60 11 28 75 93 54 9 30 40 80 49 66 20 3 78 15 41 94 55 69 18 46 0 13 56 51 88 21 62 77 53 81 24 87 74 48 65 1 70
94
91
26 41 25 40 39 0 75 48 43 24 89 53 87 50 33 28 38 2 6 94 16 32 11 18 85 0 13 67 59 69 49 4 81 78 47 73 36 20 14 79 34 68 56 76 21 44 60 58 46 35 9 74 86 37 0 62 82 70 31 19 93 17 64 12 51 80 54 1 57 84 92 27 29 61 5 63 66 15 65 55 88 42 10 3 52 77 8 71 22 72 83 23 45 30
44
20
28 34 0 8 11 30 38 13 25 32 19 7 5 24 26 44 43 3 12 36 4 1 10 42 39 17 22 18 13 15 9 21 16 29 40 14 41 23 37 2 33 35 31 27
85
46
77 23 73 47 76 67 61 41 49 2 43 19 1 31 26 69 5 79 54 21 25 56 85 32 44 8 22 34 28 38 4 45 83 3 42 55 13 82 0 50 52 51 27 84 78 71 70 33 75 63 24 36 39 62 74 37 81 30 72 59 11 60 64 57 9 58 68 35 7 0 20 17 14 16 66 40 80 65 6 29 10 15 12 48 18
Output 2
46 26 8 5 32 85 77 CICLO INFERNAL
91 83 10 24 18 2 41 34 78 15 33 81 88 71 92 23 11 89 22 32 4 40 79 65 51 9 43 56 62 17 38 20 94 30 69 57 82 42 68 1 26
20 36 14 24 42 35 40 2 34 29 13 5 11 19 12 7 38 23 10 32 21 4 8 CICLO INFERNAL
46 71 20 21 25 44 84 48 33 83 12 19 54 62 60 59 72 17 5 76 40 50 63 64 57 81 10 2 23 85 18 79 6 67 68 35 42 51 24 32 45 78 65 9 49 75 66 58 30 38 82 15 26 8 41 52 36 55 74 16 69 7 61 11 43 27 22 56 37 13 1 77 80 29 28 34 3 73 14 31 4 47 70
Input 3
7
28
1
6 8 7 26 14 10 28 21 27 5 23 0 2 20 12 21 16 22 4 9 11 24 25 19 3 13 17 18
81
4
0 29 20 2 19 40 36 3 16 43 72 30 59 5 47 64 62 75 26 51 56 63 68 55 58 69 13 76 34 24 32 27 74 65 52 60 45 49 78 53 18 44 57 71 8 79 23 6 67 81 25 9 54 38 42 50 37 80 46 28 33 35 39 15 73 10 31 70 21 42 61 1 48 14 66 17 22 11 12 7 41
100
81
3 53 23 0 7 92 93 89 68 69 32 26 17 63 13 86 65 47 48 64 4 45 75 60 70 51 40 94 91 66 44 37 95 2 25 10 50 35 62 54 74 38 52 30 76 84 24 83 96 41 78 31 21 98 12 97 29 79 42 99 43 27 28 18 90 11 82 49 85 16 73 59 39 100 61 72 56 20 33 67 58 8 55 5 9 57 22 1 77 80 0 88 71 19 14 15 34 87 36 46
75
36
33 68 65 55 16 10 52 42 66 74 64 0 0 4 73 39 26 1 28 6 24 57 41 58 32 22 46 37 17 43 3 19 53 67 30 45 63 62 70 54 2 11 72 8 61 50 9 0 7 14 48 59 40 56 23 27 5 69 25 13 38 12 47 34 75 31 18 51 29 71 60 21 20 49 35
95
14
40 15 5 61 59 12 38 94 80 16 45 24 53 58 69 37 6 62 95 91 93 81 71 22 75 47 0 78 84 8 51 7 52 19 77 21 66 26 79 9 0 55 34 82 50 74 83 63 54 48 43 88 44 35 70 73 27 32 90 20 2 86 29 92 41 87 57 13 46 85 65 1 31 39 17 28 25 64 56 4 76 10 18 33 89 11 3 72 30 49 67 42 60 23 68
82
18
7 78 34 8 68 40 69 75 10 62 13 57 46 17 67 47 32 5 27 73 51 66 45 55 49 76 1 48 37 80 74 50 79 35 0 71 77 24 41 39 60 56 58 63 38 30 65 12 31 15 20 61 25 43 29 22 81 82 4 16 23 28 21 6 59 44 19 70 72 26 42 3 53 64 33 9 14 54 2 52 0 11
37
6
4 15 17 19 23 20 8 34 30 13 37 7 0 3 0 26 25 33 31 2 14 36 24 32 12 10 1 9 28 5 18 22 29 16 27 21 35
Output 3
1 6 10 5 14 20 9 27 17 16 21 11 23 25 3 7 28 18 22 24 19 4 26 13 2 8 CICLO INFERNAL
4 2 29 34 65 73 48 6 40 53 54 38 49 67 31 32 27 13 59 46 79 12 30 24 55 42 44 71 61 33 74 14 5 19 26 69 21 56 50 81 41 18 75 66 10 43 57 37 45 8 3 20 51 25 58 80 7 36 60 28 76 17 62 35 52 9 16 64 15 47 23 68 70 CICLO INFERNAL
81 58 79 33 95 14 63 28 94 19 48 83 55 12 26 51 78 20 64 18 47 24 60 99 36 10 69 85 9 68 49 96 15 13 17 65 90 80 67 82 8 89 77 56 97 34 2 53 21 4
36 45 61 38 62 12
14 58 32 7 38 26 47 83 18 62 86 11 45 50 48 63 29 84 33 52 88 72 1 40 9 80 4 61 2 15 69 46 74 39 79 56 73 31 51 43 34 19 95 68 13 53 44 82 10 16 37 66 87 3 5 59 90 49 54 35 77 25 75 17 6 12 24 22 81 76 28 78 64 92 42 55 70 85 89 30 8 94 23 71 65 41
18 5 68 70 26 76 9 10 62 28 48 12 57 81
6 20 2 15
Input 4
8
27
8
15 14 10 13 3 4 20 22 7 9 18 6 17 24 16 12 19 5 11 27 23 21 25 26 1 0 2
30
1
17 11 27 9 19 15 10 16 0 29 21 7 30 4 0 12 20 25 22 18 14 0 8 23 3 2 26 13 6 24
65
21
19 59 63 30 31 33 18 11 40 50 44 29 58 27 8 14 4 61 39 60 35 0 6 51 23 43 47 65 57 15 1 2 41 37 3 7 56 10 32 28 36 46 20 38 52 48 25 12 62 53 45 49 64 5 24 54 26 9 22 34 17 16 55 13 42
40
29
0 37 29 36 19 0 21 17 8 32 30 11 31 26 35 2 28 15 6 4 10 9 18 33 20 22 16 13 3 24 27 23 5 7 40 12 34 14 38 0
76
36
3 75 55 63 12 4 59 56 46 23 31 74 1 33 60 5 9 42 45 50 2 73 30 25 53 28 61 67 20 65 17 34 11 66 29 21 70 35 54 39 15 57 72 0 0 47 0 10 64 18 8 7 52 69 76 43 68 44 32 14 37 38 71 51 6 13 27 26 19 49 16 24 40 62 22 58
63
59
17 60 11 19 47 31 54 36 26 45 4 41 16 0 6 9 49 29 53 10 48 1 44 37 62 52 20 27 56 61 22 51 32 49 3 25 33 39 42 63 28 24 23 5 13 35 14 12 21 40 2 30 34 18 7 15 58 38 50 8 46 43 55
29
26
16 23 14 19 24 10 21 0 7 15 5 18 29 8 9 28 4 27 25 6 1 12 20 2 3 22 11 13 17
73
18
49 60 55 54 44 72 53 0 64 28 58 8 1 26 36 47 38 21 67 52 29 59 56 69 20 17 25 9 63 3 13 30 41 51 11 7 6 73 24 70 4 27 61 57 50 65 37 2 14 5 22 35 19 48 16 39 62 32 68 40 15 33 34 43 45 23 46 42 31 66 12 10 71
Output 4
8 22 21 23 25 1 15 16 12 6 4 13 17 19 11 18 5 3 10 9 7 20 27 2 14 24 26
1 17 20 18 25 3 27 26 2 11 21 14 4 9
21 35 3 63 55 24 51 45 52 49 62 16 14 27 47 25 23 6 33 41 36 7 18 61 17 4 30 15 8 11 44 38 10 50 53 64 13 58 9 40 28 65 42 46 48 12 29 57 26 43 20 60 34 37 56 54 5 31 1 19 39 32 2 59 22
29 3 CICLO INFERNAL
36 21 2 75 22 73 40 39 54 69 19 45
59 50 40 63 55 7 54 18 29 56 15 6 31 22 1 17 49 21 48 12 41 28 27 20 10 45 13 16 9 26 52 30 61 46 35 3 11 4 19 53 34 CICLO INFERNAL
26 22 12 18 27 11 5 24 2 23 20 6 10 15 9 7 21 1 16 28 13 29 17 4 19 25 3 14 8
18 21 29 63 34 51 22 59 68 42 27 25 20 52 35 11 58 32 30 3 55 16 47 37 6 72 10 28 9 64 43 61 15 36 7 53 19 67 46 65 45 50 5 44 57 62 33 41 4 54 48 2 60 40 70 66 23 56 39 24 69 31 13 1 49 14 26 17 38 73 71 12 8
Input 5
7
41
30
20 13 26 35 41 10 17 7 38 37 19 23 15 0 33 0 22 34 12 3 2 9 21 27 31 32 4 5 28 20 24 40 25 8 16 14 0 39 6 1 18
47
4
2 28 22 32 3 40 1 45 24 9 25 11 34 16 13 10 44 29 5 38 20 42 43 41 21 30 36 27 46 23 26 37 12 8 14 17 33 6 15 47 0 35 7 39 19 31 18
20
15
3 0 18 20 15 19 17 0 6 11 5 2 16 1 7 14 13 10 8 9
28
9
8 0 27 6 7 12 22 28 16 28 17 23 4 13 0 10 14 0 25 2 19 21 15 1 18 20 26 24
82
6
51 22 41 30 43 81 74 0 34 2 33 53 76 3 60 66 4 20 56 57 45 50 16 42 12 36 58 29 17 35 9 47 1 0 46 13 75 79 10 70 15 77 27 6 68 18 31 26 72 80 67 64 65 7 37 78 25 28 11 5 38 49 23 8 54 21 39 71 55 62 73 61 48 40 52 44 19 32 24 69 82 63
88
5
18 67 30 49 77 56 76 68 40 7 13 19 39 38 86 0 83 37 74 4 20 15 48 6 47 9 17 73 69 59 35 11 36 61 33 43 88 45 82 54 57 25 81 12 65 10 2 72 80 71 58 42 41 24 8 14 50 52 62 21 53 34 60 32 46 70 26 3 66 63 22 28 64 84 55 16 27 85 29 44 23 51 1 87 31 79 78 75
84
82
21 12 1 79 2 27 36 75 66 43 19 68 62 76 5 35 54 48 33 4 70 73 59 67 3 18 10 49 22 41 28 26 60 55 34 83 50 42 58 63 11 64 38 71 61 7 8 6 78 72 16 25 81 45 52 30 39 29 9 37 32 69 77 46 57 40 17 24 56 14 47 0 80 31 51 74 15 13 84 44 65 20 53 23
Output 5
30 20 3 26 32 40 1 CICLO INFERNAL
4 32 37 33 12 11 25 21 20 38 6 40 47 18 29 46 31 26 30 23 43 7 1 2 28 27 36 17 44 39 15 13 34 8 45 19 5 3 22 42 35 14 16 10 9 24 41
15 7 17 13 16 14 1 3 18 10 11 5 CICLO INFERNAL
9 16 10 28 24 1 8 CICLO INFERNAL
6 81 82 63 23 16 66 21 45 68 71 73 48 26 36 13 76 44 CICLO INFERNAL
5 77 27 17 83 1 18 37 88 75 55 8 68 3 30 59 62 34 61 53 41 57 50 71 22 15 86 79 29 69 66 70 63 60 21 20 4 49 80 44 12 19 74 84 87 78 85 31 35 33 36 43 81 23 48 72 28 73 64 32 11 13 39 82 51 58 52 42 25 47 2 67 26 9 40 54 24 6 56 14 38 45 65 46 10 7 76 16
82 20 4 79 84 23 59 9 66 40 63 77 15 5 2 12 68 24 67 17 54 45 61 32 26 18 48 6 27 10 43 38 42 64 46 7 36 83 53 81 65 57 39 58 29 22 73 80 44 71 47 8 75 51 16 35 34 55 52 25 3 1 21 70 14 76 74 31 28 49 78 13 62 69 56 30 41 11 19 33 60 37 50 72
*/